grevaillot/svd_tools/headers/STM32L4x6/can2.h
/** CAN2_RF1R_RFOM1 RFOM1 **/
#define CAN2_RF1R_RFOM1		(1 << 5)
/** CAN2_RF1R_FOVR1 FOVR1 **/
#define CAN2_RF1R_FOVR1		(1 << 4)
/** CAN2_RF1R_FULL1 FULL1 **/
#define CAN2_RF1R_FULL1		(1 << 3)

#define CAN2_RF1R_FMP1_SHIFT		0
#define CAN2_RF1R_FMP1_MASK		0x03
/** @defgroup can2_rf1r_fmp1 FMP1 FMP1
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_ier IER interrupt enable register
@{*/

/** CAN2_IER_SLKIE SLKIE **/
#define CAN2_IER_SLKIE		(1 << 17)
/** CAN2_IER_WKUIE WKUIE **/
#define CAN2_IER_WKUIE		(1 << 16)
/** CAN2_IER_ERRIE ERRIE **/
#define CAN2_IER_ERRIE		(1 << 15)
/** CAN2_IER_LECIE LECIE **/
#define CAN2_IER_LECIE		(1 << 11)
/** CAN2_IER_BOFIE BOFIE **/
#define CAN2_IER_BOFIE		(1 << 10)
/** CAN2_IER_EPVIE EPVIE **/
#define CAN2_IER_EPVIE		(1 << 9)
/** CAN2_IER_EWGIE EWGIE **/
#define CAN2_IER_EWGIE		(1 << 8)
/** CAN2_IER_FOVIE1 FOVIE1 **/
#define CAN2_IER_FOVIE1		(1 << 6)
/** CAN2_IER_FFIE1 FFIE1 **/
#define CAN2_IER_FFIE1		(1 << 5)
/** CAN2_IER_FMPIE1 FMPIE1 **/
#define CAN2_IER_FMPIE1		(1 << 4)
/** CAN2_IER_FOVIE0 FOVIE0 **/
#define CAN2_IER_FOVIE0		(1 << 3)
/** CAN2_IER_FFIE0 FFIE0 **/
#define CAN2_IER_FFIE0		(1 << 2)
/** CAN2_IER_FMPIE0 FMPIE0 **/
#define CAN2_IER_FMPIE0		(1 << 1)
/** CAN2_IER_TMEIE TMEIE **/
#define CAN2_IER_TMEIE		(1 << 0)

/**@}*/

/** @defgroup can2_esr ESR interrupt enable register
@{*/


#define CAN2_ESR_REC_SHIFT		24
#define CAN2_ESR_REC_MASK		0xff
/** @defgroup can2_esr_rec REC REC
@{*/
/**@}*/


#define CAN2_ESR_TEC_SHIFT		16
#define CAN2_ESR_TEC_MASK		0xff
/** @defgroup can2_esr_tec TEC TEC
@{*/
/**@}*/


#define CAN2_ESR_LEC_SHIFT		4
#define CAN2_ESR_LEC_MASK		0x07
/** @defgroup can2_esr_lec LEC LEC
@{*/
/**@}*/

/** CAN2_ESR_BOFF BOFF **/
#define CAN2_ESR_BOFF		(1 << 2)
/** CAN2_ESR_EPVF EPVF **/
#define CAN2_ESR_EPVF		(1 << 1)
/** CAN2_ESR_EWGF EWGF **/
#define CAN2_ESR_EWGF		(1 << 0)

/**@}*/

/** @defgroup can2_btr BTR bit timing register
@{*/

/** CAN2_BTR_SILM SILM **/
#define CAN2_BTR_SILM		(1 << 31)
/** CAN2_BTR_LBKM LBKM **/
#define CAN2_BTR_LBKM		(1 << 30)

#define CAN2_BTR_SJW_SHIFT		24
#define CAN2_BTR_SJW_MASK		0x03
/** @defgroup can2_btr_sjw SJW SJW
@{*/
/**@}*/


#define CAN2_BTR_TS2_SHIFT		20
#define CAN2_BTR_TS2_MASK		0x07
/** @defgroup can2_btr_ts2 TS2 TS2
@{*/
/**@}*/


#define CAN2_BTR_TS1_SHIFT		16
#define CAN2_BTR_TS1_MASK		0x0f
/** @defgroup can2_btr_ts1 TS1 TS1
@{*/
/**@}*/


#define CAN2_BTR_BRP_SHIFT		0
#define CAN2_BTR_BRP_MASK		0x3ff
/** @defgroup can2_btr_brp BRP BRP
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_ti0r TI0R TX mailbox identifier register
@{*/


#define CAN2_TI0R_STID_SHIFT		21
#define CAN2_TI0R_STID_MASK		0x7ff
/** @defgroup can2_ti0r_stid STID STID
@{*/
/**@}*/


#define CAN2_TI0R_EXID_SHIFT		3
#define CAN2_TI0R_EXID_MASK		0x3ffff
/** @defgroup can2_ti0r_exid EXID EXID
@{*/
/**@}*/

/** CAN2_TI0R_IDE IDE **/
#define CAN2_TI0R_IDE		(1 << 2)
/** CAN2_TI0R_RTR RTR **/
#define CAN2_TI0R_RTR		(1 << 1)
/** CAN2_TI0R_TXRQ TXRQ **/
#define CAN2_TI0R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can2_tdt0r TDT0R mailbox data length control and time stamp register
@{*/


#define CAN2_TDT0R_TIME_SHIFT		16
#define CAN2_TDT0R_TIME_MASK		0xffff
/** @defgroup can2_tdt0r_time TIME TIME
@{*/
/**@}*/

/** CAN2_TDT0R_TGT TGT **/
#define CAN2_TDT0R_TGT		(1 << 8)

#define CAN2_TDT0R_DLC_SHIFT		0
#define CAN2_TDT0R_DLC_MASK		0x0f
/** @defgroup can2_tdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_tdl0r TDL0R mailbox data low register
@{*/


#define CAN2_TDL0R_DATA3_SHIFT		24
#define CAN2_TDL0R_DATA3_MASK		0xff
/** @defgroup can2_tdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN2_TDL0R_DATA2_SHIFT		16
#define CAN2_TDL0R_DATA2_MASK		0xff
/** @defgroup can2_tdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN2_TDL0R_DATA1_SHIFT		8
#define CAN2_TDL0R_DATA1_MASK		0xff
/** @defgroup can2_tdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN2_TDL0R_DATA0_SHIFT		0
#define CAN2_TDL0R_DATA0_MASK		0xff
/** @defgroup can2_tdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_tdh0r TDH0R mailbox data high register
@{*/


#define CAN2_TDH0R_DATA7_SHIFT		24
#define CAN2_TDH0R_DATA7_MASK		0xff
/** @defgroup can2_tdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN2_TDH0R_DATA6_SHIFT		16
#define CAN2_TDH0R_DATA6_MASK		0xff
/** @defgroup can2_tdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN2_TDH0R_DATA5_SHIFT		8
#define CAN2_TDH0R_DATA5_MASK		0xff
/** @defgroup can2_tdh0r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN2_TDH0R_DATA4_SHIFT		0
#define CAN2_TDH0R_DATA4_MASK		0xff
/** @defgroup can2_tdh0r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_ti1r TI1R mailbox identifier register
@{*/


#define CAN2_TI1R_STID_SHIFT		21
#define CAN2_TI1R_STID_MASK		0x7ff
/** @defgroup can2_ti1r_stid STID STID
@{*/
/**@}*/


#define CAN2_TI1R_EXID_SHIFT		3
#define CAN2_TI1R_EXID_MASK		0x3ffff
/** @defgroup can2_ti1r_exid EXID EXID
@{*/
/**@}*/

/** CAN2_TI1R_IDE IDE **/
#define CAN2_TI1R_IDE		(1 << 2)
/** CAN2_TI1R_RTR RTR **/
#define CAN2_TI1R_RTR		(1 << 1)
/** CAN2_TI1R_TXRQ TXRQ **/
#define CAN2_TI1R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can2_tdt1r TDT1R mailbox data length control and time stamp register
@{*/


#define CAN2_TDT1R_TIME_SHIFT		16
#define CAN2_TDT1R_TIME_MASK		0xffff
/** @defgroup can2_tdt1r_time TIME TIME
@{*/
/**@}*/

/** CAN2_TDT1R_TGT TGT **/
#define CAN2_TDT1R_TGT		(1 << 8)

#define CAN2_TDT1R_DLC_SHIFT		0
#define CAN2_TDT1R_DLC_MASK		0x0f
/** @defgroup can2_tdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_tdl1r TDL1R mailbox data low register
@{*/


#define CAN2_TDL1R_DATA3_SHIFT		24
#define CAN2_TDL1R_DATA3_MASK		0xff
/** @defgroup can2_tdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN2_TDL1R_DATA2_SHIFT		16
#define CAN2_TDL1R_DATA2_MASK		0xff
/** @defgroup can2_tdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN2_TDL1R_DATA1_SHIFT		8
#define CAN2_TDL1R_DATA1_MASK		0xff
/** @defgroup can2_tdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN2_TDL1R_DATA0_SHIFT		0
#define CAN2_TDL1R_DATA0_MASK		0xff
/** @defgroup can2_tdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_tdh1r TDH1R mailbox data high register
@{*/


#define CAN2_TDH1R_DATA7_SHIFT		24
#define CAN2_TDH1R_DATA7_MASK		0xff
/** @defgroup can2_tdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN2_TDH1R_DATA6_SHIFT		16
#define CAN2_TDH1R_DATA6_MASK		0xff
/** @defgroup can2_tdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN2_TDH1R_DATA5_SHIFT		8
#define CAN2_TDH1R_DATA5_MASK		0xff
/** @defgroup can2_tdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN2_TDH1R_DATA4_SHIFT		0
#define CAN2_TDH1R_DATA4_MASK		0xff
/** @defgroup can2_tdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_ti2r TI2R mailbox identifier register
@{*/


#define CAN2_TI2R_STID_SHIFT		21
#define CAN2_TI2R_STID_MASK		0x7ff
/** @defgroup can2_ti2r_stid STID STID
@{*/
/**@}*/


#define CAN2_TI2R_EXID_SHIFT		3
#define CAN2_TI2R_EXID_MASK		0x3ffff
/** @defgroup can2_ti2r_exid EXID EXID
@{*/
/**@}*/

/** CAN2_TI2R_IDE IDE **/
#define CAN2_TI2R_IDE		(1 << 2)
/** CAN2_TI2R_RTR RTR **/
#define CAN2_TI2R_RTR		(1 << 1)
/** CAN2_TI2R_TXRQ TXRQ **/
#define CAN2_TI2R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can2_tdt2r TDT2R mailbox data length control and time stamp register
@{*/


#define CAN2_TDT2R_TIME_SHIFT		16
#define CAN2_TDT2R_TIME_MASK		0xffff
/** @defgroup can2_tdt2r_time TIME TIME
@{*/
/**@}*/

/** CAN2_TDT2R_TGT TGT **/
#define CAN2_TDT2R_TGT		(1 << 8)

